app/Controllers/Admin.php

    public function index()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        $postModel = new PostModel();
        $data['posts'] = $postModel->findAll();
---
SELECT *
FROM `posts`

    public function store()
    {
        $postModel = new PostModel();

        $imagen = $this->request->getFile('imagen');
        $nombreImagen = '';

        if ($imagen && $imagen->isValid() && !$imagen->hasMoved() &&
            in_array($imagen->getMimeType(), ['image/jpeg', 'image/png', 'image/webp'])) {

            $nombreImagen = $imagen->getRandomName();
            $imagen->move(ROOTPATH . 'public/uploads', $nombreImagen);
        }

        $postModel->save([
            'titulo'    => $this->request->getPost('titulo'),
            'fecha'     => $this->request->getPost('fecha'),
            'categoria' => $this->request->getPost('categoria'),
            'contenido' => $this->request->getPost('contenido'),
            'imagen'    => $nombreImagen
        ]);
---
INSERT INTO `posts` (`titulo`, `fecha`, `categoria`, `contenido`, `imagen`) VALUES ('prueba', '2025-07-23', 'prueba', 'prueba', 'prueba')

    public function edit($id)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        $postModel = new PostModel();
        $data['post'] = $postModel->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '8'

    public function update($id)
    {
        $postModel = new PostModel();
        $post = $postModel->find($id);

        $imagen = $this->request->getFile('imagen');
        $nombreImagen = $post['imagen']; // por defecto la misma imagen

        if ($imagen && $imagen->isValid() && !$imagen->hasMoved() &&
            in_array($imagen->getMimeType(), ['image/jpeg', 'image/png', 'image/webp'])) {

            // Eliminar imagen anterior
            if (!empty($post['imagen']) && file_exists(ROOTPATH . 'public/uploads/' . $post['imagen'])) {
                unlink(ROOTPATH . 'public/uploads/' . $post['imagen']);
            }

            // Guardar nueva imagen
            $nombreImagen = $imagen->getRandomName();
            $imagen->move(ROOTPATH . 'public/uploads', $nombreImagen);
        }

        $postModel->update($id, [
            'titulo'    => $this->request->getPost('titulo'),
            'fecha'     => $this->request->getPost('fecha'),
            'categoria' => $this->request->getPost('categoria'),
            'contenido' => $this->request->getPost('contenido'),
            'imagen'    => $nombreImagen
        ]);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '8'
UPDATE `posts` SET `titulo` = 'prueba', `fecha` = '2025-07-23', `categoria` = 'prueba', `contenido` = 'prueba', `imagen` = '1753323094_ad385b618bcf42a8878e.jpg'
WHERE `posts`.`id` IN ('8')