app/Controllers/Blog.php

    public function index()
    {
        // Cargar el modelo de Post
        $postModel = new PostModel();
        $data['posts'] = $postModel->findAll();
---
SELECT *
FROM `posts`